# Реализовать вывод информации о промежутке времени в зависимости от его продолжительности duration в секундах:
# до минуты: <s> сек;
# до часа: <m> мин <s> сек;
# до суток: <h> час <m> мин <s> сек;
# * в остальных случаях: <d> дн <h> час <m> мин <s> сек.
time=int(input('Введите время в секундах: '))
if time<60:
    print(f"{time} с.")
elif time<3600:
    print(f"{time//60} м. {time%60} с. ")
elif time<3600*24:
    print(f"{time//3600} ч. {(time%3600)//60} м. {(time%3600)%60} с. ")
else :print(f"{(time//(3600*24))} д.{(time%(3600*24))//3600} ч.{((time%(3600*24))%3600)//60} м.{((time%(3600*24))%3600)%60}секунд ")